GopalSaraf/Practicals/PSDL/include/proc/pic16f18875.inc
// Register: PWM7DCH
#define PWM7DCH PWM7DCH
PWM7DCH                                  equ 0391h
// bitfield definitions
PWM7DCH_DC_POSN                          equ 0000h
PWM7DCH_DC_POSITION                      equ 0000h
PWM7DCH_DC_SIZE                          equ 0008h
PWM7DCH_DC_LENGTH                        equ 0008h
PWM7DCH_DC_MASK                          equ 00FFh
PWM7DCH_DC2_POSN                         equ 0000h
PWM7DCH_DC2_POSITION                     equ 0000h
PWM7DCH_DC2_SIZE                         equ 0001h
PWM7DCH_DC2_LENGTH                       equ 0001h
PWM7DCH_DC2_MASK                         equ 0001h
PWM7DCH_DC3_POSN                         equ 0001h
PWM7DCH_DC3_POSITION                     equ 0001h
PWM7DCH_DC3_SIZE                         equ 0001h
PWM7DCH_DC3_LENGTH                       equ 0001h
PWM7DCH_DC3_MASK                         equ 0002h
PWM7DCH_DC4_POSN                         equ 0002h
PWM7DCH_DC4_POSITION                     equ 0002h
PWM7DCH_DC4_SIZE                         equ 0001h
PWM7DCH_DC4_LENGTH                       equ 0001h
PWM7DCH_DC4_MASK                         equ 0004h
PWM7DCH_DC5_POSN                         equ 0003h
PWM7DCH_DC5_POSITION                     equ 0003h
PWM7DCH_DC5_SIZE                         equ 0001h
PWM7DCH_DC5_LENGTH                       equ 0001h
PWM7DCH_DC5_MASK                         equ 0008h
PWM7DCH_DC6_POSN                         equ 0004h
PWM7DCH_DC6_POSITION                     equ 0004h
PWM7DCH_DC6_SIZE                         equ 0001h
PWM7DCH_DC6_LENGTH                       equ 0001h
PWM7DCH_DC6_MASK                         equ 0010h
PWM7DCH_DC7_POSN                         equ 0005h
PWM7DCH_DC7_POSITION                     equ 0005h
PWM7DCH_DC7_SIZE                         equ 0001h
PWM7DCH_DC7_LENGTH                       equ 0001h
PWM7DCH_DC7_MASK                         equ 0020h
PWM7DCH_DC8_POSN                         equ 0006h
PWM7DCH_DC8_POSITION                     equ 0006h
PWM7DCH_DC8_SIZE                         equ 0001h
PWM7DCH_DC8_LENGTH                       equ 0001h
PWM7DCH_DC8_MASK                         equ 0040h
PWM7DCH_DC9_POSN                         equ 0007h
PWM7DCH_DC9_POSITION                     equ 0007h
PWM7DCH_DC9_SIZE                         equ 0001h
PWM7DCH_DC9_LENGTH                       equ 0001h
PWM7DCH_DC9_MASK                         equ 0080h
PWM7DCH_PWM7DC2_POSN                     equ 0000h
PWM7DCH_PWM7DC2_POSITION                 equ 0000h
PWM7DCH_PWM7DC2_SIZE                     equ 0001h
PWM7DCH_PWM7DC2_LENGTH                   equ 0001h
PWM7DCH_PWM7DC2_MASK                     equ 0001h
PWM7DCH_PWM7DC3_POSN                     equ 0001h
PWM7DCH_PWM7DC3_POSITION                 equ 0001h
PWM7DCH_PWM7DC3_SIZE                     equ 0001h
PWM7DCH_PWM7DC3_LENGTH                   equ 0001h
PWM7DCH_PWM7DC3_MASK                     equ 0002h
PWM7DCH_PWM7DC4_POSN                     equ 0002h
PWM7DCH_PWM7DC4_POSITION                 equ 0002h
PWM7DCH_PWM7DC4_SIZE                     equ 0001h
PWM7DCH_PWM7DC4_LENGTH                   equ 0001h
PWM7DCH_PWM7DC4_MASK                     equ 0004h
PWM7DCH_PWM7DC5_POSN                     equ 0003h
PWM7DCH_PWM7DC5_POSITION                 equ 0003h
PWM7DCH_PWM7DC5_SIZE                     equ 0001h
PWM7DCH_PWM7DC5_LENGTH                   equ 0001h
PWM7DCH_PWM7DC5_MASK                     equ 0008h
PWM7DCH_PWM7DC6_POSN                     equ 0004h
PWM7DCH_PWM7DC6_POSITION                 equ 0004h
PWM7DCH_PWM7DC6_SIZE                     equ 0001h
PWM7DCH_PWM7DC6_LENGTH                   equ 0001h
PWM7DCH_PWM7DC6_MASK                     equ 0010h
PWM7DCH_PWM7DC7_POSN                     equ 0005h
PWM7DCH_PWM7DC7_POSITION                 equ 0005h
PWM7DCH_PWM7DC7_SIZE                     equ 0001h
PWM7DCH_PWM7DC7_LENGTH                   equ 0001h
PWM7DCH_PWM7DC7_MASK                     equ 0020h
PWM7DCH_PWM7DC8_POSN                     equ 0006h
PWM7DCH_PWM7DC8_POSITION                 equ 0006h
PWM7DCH_PWM7DC8_SIZE                     equ 0001h
PWM7DCH_PWM7DC8_LENGTH                   equ 0001h
PWM7DCH_PWM7DC8_MASK                     equ 0040h
PWM7DCH_PWM7DC9_POSN                     equ 0007h
PWM7DCH_PWM7DC9_POSITION                 equ 0007h
PWM7DCH_PWM7DC9_SIZE                     equ 0001h
PWM7DCH_PWM7DC9_LENGTH                   equ 0001h
PWM7DCH_PWM7DC9_MASK                     equ 0080h
PWM7DCH_PWMPW2_POSN                      equ 0000h
PWM7DCH_PWMPW2_POSITION                  equ 0000h
PWM7DCH_PWMPW2_SIZE                      equ 0001h
PWM7DCH_PWMPW2_LENGTH                    equ 0001h
PWM7DCH_PWMPW2_MASK                      equ 0001h
PWM7DCH_PWMPW3_POSN                      equ 0001h
PWM7DCH_PWMPW3_POSITION                  equ 0001h
PWM7DCH_PWMPW3_SIZE                      equ 0001h
PWM7DCH_PWMPW3_LENGTH                    equ 0001h
PWM7DCH_PWMPW3_MASK                      equ 0002h
PWM7DCH_PWMPW4_POSN                      equ 0002h
PWM7DCH_PWMPW4_POSITION                  equ 0002h
PWM7DCH_PWMPW4_SIZE                      equ 0001h
PWM7DCH_PWMPW4_LENGTH                    equ 0001h
PWM7DCH_PWMPW4_MASK                      equ 0004h
PWM7DCH_PWMPW5_POSN                      equ 0003h
PWM7DCH_PWMPW5_POSITION                  equ 0003h
PWM7DCH_PWMPW5_SIZE                      equ 0001h
PWM7DCH_PWMPW5_LENGTH                    equ 0001h
PWM7DCH_PWMPW5_MASK                      equ 0008h
PWM7DCH_PWMPW6_POSN                      equ 0004h
PWM7DCH_PWMPW6_POSITION                  equ 0004h
PWM7DCH_PWMPW6_SIZE                      equ 0001h
PWM7DCH_PWMPW6_LENGTH                    equ 0001h
PWM7DCH_PWMPW6_MASK                      equ 0010h
PWM7DCH_PWMPW7_POSN                      equ 0005h
PWM7DCH_PWMPW7_POSITION                  equ 0005h
PWM7DCH_PWMPW7_SIZE                      equ 0001h
PWM7DCH_PWMPW7_LENGTH                    equ 0001h
PWM7DCH_PWMPW7_MASK                      equ 0020h
PWM7DCH_PWMPW8_POSN                      equ 0006h
PWM7DCH_PWMPW8_POSITION                  equ 0006h
PWM7DCH_PWMPW8_SIZE                      equ 0001h
PWM7DCH_PWMPW8_LENGTH                    equ 0001h
PWM7DCH_PWMPW8_MASK                      equ 0040h
PWM7DCH_PWMPW9_POSN                      equ 0007h
PWM7DCH_PWMPW9_POSITION                  equ 0007h
PWM7DCH_PWMPW9_SIZE                      equ 0001h
PWM7DCH_PWMPW9_LENGTH                    equ 0001h
PWM7DCH_PWMPW9_MASK                      equ 0080h

// Register: PWM7CON
#define PWM7CON PWM7CON
PWM7CON                                  equ 0392h
// bitfield definitions
PWM7CON_POL_POSN                         equ 0004h
PWM7CON_POL_POSITION                     equ 0004h
PWM7CON_POL_SIZE                         equ 0001h
PWM7CON_POL_LENGTH                       equ 0001h
PWM7CON_POL_MASK                         equ 0010h
PWM7CON_OUT_POSN                         equ 0005h
PWM7CON_OUT_POSITION                     equ 0005h
PWM7CON_OUT_SIZE                         equ 0001h
PWM7CON_OUT_LENGTH                       equ 0001h
PWM7CON_OUT_MASK                         equ 0020h
PWM7CON_EN_POSN                          equ 0007h
PWM7CON_EN_POSITION                      equ 0007h
PWM7CON_EN_SIZE                          equ 0001h
PWM7CON_EN_LENGTH                        equ 0001h
PWM7CON_EN_MASK                          equ 0080h
PWM7CON_PWM7POL_POSN                     equ 0004h
PWM7CON_PWM7POL_POSITION                 equ 0004h
PWM7CON_PWM7POL_SIZE                     equ 0001h
PWM7CON_PWM7POL_LENGTH                   equ 0001h
PWM7CON_PWM7POL_MASK                     equ 0010h
PWM7CON_PWM7OUT_POSN                     equ 0005h
PWM7CON_PWM7OUT_POSITION                 equ 0005h
PWM7CON_PWM7OUT_SIZE                     equ 0001h
PWM7CON_PWM7OUT_LENGTH                   equ 0001h
PWM7CON_PWM7OUT_MASK                     equ 0020h
PWM7CON_PWM7EN_POSN                      equ 0007h
PWM7CON_PWM7EN_POSITION                  equ 0007h
PWM7CON_PWM7EN_SIZE                      equ 0001h
PWM7CON_PWM7EN_LENGTH                    equ 0001h
PWM7CON_PWM7EN_MASK                      equ 0080h

// Register: SCANLADRL
#define SCANLADRL SCANLADRL
SCANLADRL                                equ 040Ch
// bitfield definitions
SCANLADRL_LADRL_POSN                     equ 0000h
SCANLADRL_LADRL_POSITION                 equ 0000h
SCANLADRL_LADRL_SIZE                     equ 0008h
SCANLADRL_LADRL_LENGTH                   equ 0008h
SCANLADRL_LADRL_MASK                     equ 00FFh
SCANLADRL_LADR0_POSN                     equ 0000h
SCANLADRL_LADR0_POSITION                 equ 0000h
SCANLADRL_LADR0_SIZE                     equ 0001h
SCANLADRL_LADR0_LENGTH                   equ 0001h
SCANLADRL_LADR0_MASK                     equ 0001h
SCANLADRL_LADR1_POSN                     equ 0001h
SCANLADRL_LADR1_POSITION                 equ 0001h
SCANLADRL_LADR1_SIZE                     equ 0001h
SCANLADRL_LADR1_LENGTH                   equ 0001h
SCANLADRL_LADR1_MASK                     equ 0002h
SCANLADRL_LADR2_POSN                     equ 0002h
SCANLADRL_LADR2_POSITION                 equ 0002h
SCANLADRL_LADR2_SIZE                     equ 0001h
SCANLADRL_LADR2_LENGTH                   equ 0001h
SCANLADRL_LADR2_MASK                     equ 0004h
SCANLADRL_LADR3_POSN                     equ 0003h
SCANLADRL_LADR3_POSITION                 equ 0003h
SCANLADRL_LADR3_SIZE                     equ 0001h
SCANLADRL_LADR3_LENGTH                   equ 0001h
SCANLADRL_LADR3_MASK                     equ 0008h
SCANLADRL_LADR4_POSN                     equ 0004h
SCANLADRL_LADR4_POSITION                 equ 0004h
SCANLADRL_LADR4_SIZE                     equ 0001h
SCANLADRL_LADR4_LENGTH                   equ 0001h
SCANLADRL_LADR4_MASK                     equ 0010h
SCANLADRL_LADR5_POSN                     equ 0005h
SCANLADRL_LADR5_POSITION                 equ 0005h
SCANLADRL_LADR5_SIZE                     equ 0001h
SCANLADRL_LADR5_LENGTH                   equ 0001h
SCANLADRL_LADR5_MASK                     equ 0020h
SCANLADRL_LADR6_POSN                     equ 0006h
SCANLADRL_LADR6_POSITION                 equ 0006h
SCANLADRL_LADR6_SIZE                     equ 0001h
SCANLADRL_LADR6_LENGTH                   equ 0001h
SCANLADRL_LADR6_MASK                     equ 0040h
SCANLADRL_LADR7_POSN                     equ 0007h
SCANLADRL_LADR7_POSITION                 equ 0007h
SCANLADRL_LADR7_SIZE                     equ 0001h
SCANLADRL_LADR7_LENGTH                   equ 0001h
SCANLADRL_LADR7_MASK                     equ 0080h
SCANLADRL_SCANLADRL_POSN                 equ 0000h
SCANLADRL_SCANLADRL_POSITION             equ 0000h
SCANLADRL_SCANLADRL_SIZE                 equ 0008h
SCANLADRL_SCANLADRL_LENGTH               equ 0008h
SCANLADRL_SCANLADRL_MASK                 equ 00FFh
SCANLADRL_SCANLADR0_POSN                 equ 0000h
SCANLADRL_SCANLADR0_POSITION             equ 0000h
SCANLADRL_SCANLADR0_SIZE                 equ 0001h
SCANLADRL_SCANLADR0_LENGTH               equ 0001h
SCANLADRL_SCANLADR0_MASK                 equ 0001h
SCANLADRL_SCANLADR1_POSN                 equ 0001h
SCANLADRL_SCANLADR1_POSITION             equ 0001h
SCANLADRL_SCANLADR1_SIZE                 equ 0001h
SCANLADRL_SCANLADR1_LENGTH               equ 0001h
SCANLADRL_SCANLADR1_MASK                 equ 0002h
SCANLADRL_SCANLADR2_POSN                 equ 0002h
SCANLADRL_SCANLADR2_POSITION             equ 0002h
SCANLADRL_SCANLADR2_SIZE                 equ 0001h
SCANLADRL_SCANLADR2_LENGTH               equ 0001h
SCANLADRL_SCANLADR2_MASK                 equ 0004h
SCANLADRL_SCANLADR3_POSN                 equ 0003h
SCANLADRL_SCANLADR3_POSITION             equ 0003h
SCANLADRL_SCANLADR3_SIZE                 equ 0001h
SCANLADRL_SCANLADR3_LENGTH               equ 0001h
SCANLADRL_SCANLADR3_MASK                 equ 0008h
SCANLADRL_SCANLADR4_POSN                 equ 0004h
SCANLADRL_SCANLADR4_POSITION             equ 0004h
SCANLADRL_SCANLADR4_SIZE                 equ 0001h
SCANLADRL_SCANLADR4_LENGTH               equ 0001h
SCANLADRL_SCANLADR4_MASK                 equ 0010h
SCANLADRL_SCANLADR5_POSN                 equ 0005h
SCANLADRL_SCANLADR5_POSITION             equ 0005h
SCANLADRL_SCANLADR5_SIZE                 equ 0001h
SCANLADRL_SCANLADR5_LENGTH               equ 0001h
SCANLADRL_SCANLADR5_MASK                 equ 0020h
SCANLADRL_SCANLADR6_POSN                 equ 0006h
SCANLADRL_SCANLADR6_POSITION             equ 0006h
SCANLADRL_SCANLADR6_SIZE                 equ 0001h
SCANLADRL_SCANLADR6_LENGTH               equ 0001h
SCANLADRL_SCANLADR6_MASK                 equ 0040h
SCANLADRL_SCANLADR7_POSN                 equ 0007h
SCANLADRL_SCANLADR7_POSITION             equ 0007h
SCANLADRL_SCANLADR7_SIZE                 equ 0001h
SCANLADRL_SCANLADR7_LENGTH               equ 0001h
SCANLADRL_SCANLADR7_MASK                 equ 0080h

// Register: SCANLADRH
#define SCANLADRH SCANLADRH
SCANLADRH                                equ 040Dh
// bitfield definitions
SCANLADRH_LADRH_POSN                     equ 0000h
SCANLADRH_LADRH_POSITION                 equ 0000h
SCANLADRH_LADRH_SIZE                     equ 0008h
SCANLADRH_LADRH_LENGTH                   equ 0008h
SCANLADRH_LADRH_MASK                     equ 00FFh
SCANLADRH_LADR8_POSN                     equ 0000h
SCANLADRH_LADR8_POSITION                 equ 0000h
SCANLADRH_LADR8_SIZE                     equ 0001h
SCANLADRH_LADR8_LENGTH                   equ 0001h
SCANLADRH_LADR8_MASK                     equ 0001h
SCANLADRH_LADR9_POSN                     equ 0001h
SCANLADRH_LADR9_POSITION                 equ 0001h
SCANLADRH_LADR9_SIZE                     equ 0001h
SCANLADRH_LADR9_LENGTH                   equ 0001h
SCANLADRH_LADR9_MASK                     equ 0002h
SCANLADRH_LADR10_POSN                    equ 0002h
SCANLADRH_LADR10_POSITION                equ 0002h
SCANLADRH_LADR10_SIZE                    equ 0001h
SCANLADRH_LADR10_LENGTH                  equ 0001h
SCANLADRH_LADR10_MASK                    equ 0004h
SCANLADRH_LADR11_POSN                    equ 0003h
SCANLADRH_LADR11_POSITION                equ 0003h
SCANLADRH_LADR11_SIZE                    equ 0001h
SCANLADRH_LADR11_LENGTH                  equ 0001h
SCANLADRH_LADR11_MASK                    equ 0008h
SCANLADRH_LADR12_POSN                    equ 0004h
SCANLADRH_LADR12_POSITION                equ 0004h
SCANLADRH_LADR12_SIZE                    equ 0001h
SCANLADRH_LADR12_LENGTH                  equ 0001h
SCANLADRH_LADR12_MASK                    equ 0010h
SCANLADRH_LADR13_POSN                    equ 0005h
SCANLADRH_LADR13_POSITION                equ 0005h
SCANLADRH_LADR13_SIZE                    equ 0001h
SCANLADRH_LADR13_LENGTH                  equ 0001h
SCANLADRH_LADR13_MASK                    equ 0020h
SCANLADRH_LADR14_POSN                    equ 0006h
SCANLADRH_LADR14_POSITION                equ 0006h
SCANLADRH_LADR14_SIZE                    equ 0001h
SCANLADRH_LADR14_LENGTH                  equ 0001h
SCANLADRH_LADR14_MASK                    equ 0040h
SCANLADRH_LADR15_POSN                    equ 0007h
SCANLADRH_LADR15_POSITION                equ 0007h
SCANLADRH_LADR15_SIZE                    equ 0001h
SCANLADRH_LADR15_LENGTH                  equ 0001h
SCANLADRH_LADR15_MASK                    equ 0080h
SCANLADRH_SCANLADRH_POSN                 equ 0000h
SCANLADRH_SCANLADRH_POSITION             equ 0000h
SCANLADRH_SCANLADRH_SIZE                 equ 0008h
SCANLADRH_SCANLADRH_LENGTH               equ 0008h
SCANLADRH_SCANLADRH_MASK                 equ 00FFh
SCANLADRH_SCANLADR8_POSN                 equ 0000h
SCANLADRH_SCANLADR8_POSITION             equ 0000h
SCANLADRH_SCANLADR8_SIZE                 equ 0001h
SCANLADRH_SCANLADR8_LENGTH               equ 0001h
SCANLADRH_SCANLADR8_MASK                 equ 0001h
SCANLADRH_SCANLADR9_POSN                 equ 0001h
SCANLADRH_SCANLADR9_POSITION             equ 0001h
SCANLADRH_SCANLADR9_SIZE                 equ 0001h
SCANLADRH_SCANLADR9_LENGTH               equ 0001h
SCANLADRH_SCANLADR9_MASK                 equ 0002h
SCANLADRH_SCANLADR10_POSN                equ 0002h
SCANLADRH_SCANLADR10_POSITION            equ 0002h
SCANLADRH_SCANLADR10_SIZE                equ 0001h
SCANLADRH_SCANLADR10_LENGTH              equ 0001h
SCANLADRH_SCANLADR10_MASK                equ 0004h
SCANLADRH_SCANLADR11_POSN                equ 0003h
SCANLADRH_SCANLADR11_POSITION            equ 0003h
SCANLADRH_SCANLADR11_SIZE                equ 0001h
SCANLADRH_SCANLADR11_LENGTH              equ 0001h
SCANLADRH_SCANLADR11_MASK                equ 0008h
SCANLADRH_SCANLADR12_POSN                equ 0004h
SCANLADRH_SCANLADR12_POSITION            equ 0004h
SCANLADRH_SCANLADR12_SIZE                equ 0001h
SCANLADRH_SCANLADR12_LENGTH              equ 0001h
SCANLADRH_SCANLADR12_MASK                equ 0010h
SCANLADRH_SCANLADR13_POSN                equ 0005h
SCANLADRH_SCANLADR13_POSITION            equ 0005h
SCANLADRH_SCANLADR13_SIZE                equ 0001h
SCANLADRH_SCANLADR13_LENGTH              equ 0001h
SCANLADRH_SCANLADR13_MASK                equ 0020h
SCANLADRH_SCANLADR14_POSN                equ 0006h
SCANLADRH_SCANLADR14_POSITION            equ 0006h
SCANLADRH_SCANLADR14_SIZE                equ 0001h
SCANLADRH_SCANLADR14_LENGTH              equ 0001h
SCANLADRH_SCANLADR14_MASK                equ 0040h
SCANLADRH_SCANLADR15_POSN                equ 0007h
SCANLADRH_SCANLADR15_POSITION            equ 0007h
SCANLADRH_SCANLADR15_SIZE                equ 0001h
SCANLADRH_SCANLADR15_LENGTH              equ 0001h
SCANLADRH_SCANLADR15_MASK                equ 0080h

// Register: SCANHADRL
#define SCANHADRL SCANHADRL
SCANHADRL                                equ 040Eh
// bitfield definitions
SCANHADRL_HADRL_POSN                     equ 0000h
SCANHADRL_HADRL_POSITION                 equ 0000h
SCANHADRL_HADRL_SIZE                     equ 0008h
SCANHADRL_HADRL_LENGTH                   equ 0008h
SCANHADRL_HADRL_MASK                     equ 00FFh
SCANHADRL_HADR0_POSN                     equ 0000h
SCANHADRL_HADR0_POSITION                 equ 0000h
SCANHADRL_HADR0_SIZE                     equ 0001h
SCANHADRL_HADR0_LENGTH                   equ 0001h
SCANHADRL_HADR0_MASK                     equ 0001h
SCANHADRL_HADR1_POSN                     equ 0001h
SCANHADRL_HADR1_POSITION                 equ 0001h
SCANHADRL_HADR1_SIZE                     equ 0001h
SCANHADRL_HADR1_LENGTH                   equ 0001h
SCANHADRL_HADR1_MASK                     equ 0002h
SCANHADRL_HADR2_POSN                     equ 0002h
SCANHADRL_HADR2_POSITION                 equ 0002h
SCANHADRL_HADR2_SIZE                     equ 0001h
SCANHADRL_HADR2_LENGTH                   equ 0001h
SCANHADRL_HADR2_MASK                     equ 0004h
SCANHADRL_HADR3_POSN                     equ 0003h
SCANHADRL_HADR3_POSITION                 equ 0003h
SCANHADRL_HADR3_SIZE                     equ 0001h
SCANHADRL_HADR3_LENGTH                   equ 0001h
SCANHADRL_HADR3_MASK                     equ 0008h
SCANHADRL_HADR4_POSN                     equ 0004h
SCANHADRL_HADR4_POSITION                 equ 0004h
SCANHADRL_HADR4_SIZE                     equ 0001h
SCANHADRL_HADR4_LENGTH                   equ 0001h
SCANHADRL_HADR4_MASK                     equ 0010h
SCANHADRL_HADR5_POSN                     equ 0005h
SCANHADRL_HADR5_POSITION                 equ 0005h
SCANHADRL_HADR5_SIZE                     equ 0001h
SCANHADRL_HADR5_LENGTH                   equ 0001h
SCANHADRL_HADR5_MASK                     equ 0020h
SCANHADRL_HADR6_POSN                     equ 0006h
SCANHADRL_HADR6_POSITION                 equ 0006h
SCANHADRL_HADR6_SIZE                     equ 0001h
SCANHADRL_HADR6_LENGTH                   equ 0001h
SCANHADRL_HADR6_MASK                     equ 0040h
SCANHADRL_HADR7_POSN                     equ 0007h
SCANHADRL_HADR7_POSITION                 equ 0007h
SCANHADRL_HADR7_SIZE                     equ 0001h
SCANHADRL_HADR7_LENGTH                   equ 0001h
SCANHADRL_HADR7_MASK                     equ 0080h
SCANHADRL_SCANHADRL_POSN                 equ 0000h
SCANHADRL_SCANHADRL_POSITION             equ 0000h
SCANHADRL_SCANHADRL_SIZE                 equ 0008h
SCANHADRL_SCANHADRL_LENGTH               equ 0008h
SCANHADRL_SCANHADRL_MASK                 equ 00FFh
SCANHADRL_SCANHADR0_POSN                 equ 0000h
SCANHADRL_SCANHADR0_POSITION             equ 0000h
SCANHADRL_SCANHADR0_SIZE                 equ 0001h
SCANHADRL_SCANHADR0_LENGTH               equ 0001h
SCANHADRL_SCANHADR0_MASK                 equ 0001h
SCANHADRL_SCANHADR1_POSN                 equ 0001h
SCANHADRL_SCANHADR1_POSITION             equ 0001h
SCANHADRL_SCANHADR1_SIZE                 equ 0001h
SCANHADRL_SCANHADR1_LENGTH               equ 0001h
SCANHADRL_SCANHADR1_MASK                 equ 0002h
SCANHADRL_SCANHADR2_POSN                 equ 0002h
SCANHADRL_SCANHADR2_POSITION             equ 0002h
SCANHADRL_SCANHADR2_SIZE                 equ 0001h
SCANHADRL_SCANHADR2_LENGTH               equ 0001h
SCANHADRL_SCANHADR2_MASK                 equ 0004h
SCANHADRL_SCANHADR3_POSN                 equ 0003h
SCANHADRL_SCANHADR3_POSITION             equ 0003h
SCANHADRL_SCANHADR3_SIZE                 equ 0001h
SCANHADRL_SCANHADR3_LENGTH               equ 0001h
SCANHADRL_SCANHADR3_MASK                 equ 0008h
SCANHADRL_SCANHADR4_POSN                 equ 0004h
SCANHADRL_SCANHADR4_POSITION             equ 0004h
SCANHADRL_SCANHADR4_SIZE                 equ 0001h
SCANHADRL_SCANHADR4_LENGTH               equ 0001h
SCANHADRL_SCANHADR4_MASK                 equ 0010h
SCANHADRL_SCANHADR5_POSN                 equ 0005h
SCANHADRL_SCANHADR5_POSITION             equ 0005h
SCANHADRL_SCANHADR5_SIZE                 equ 0001h
SCANHADRL_SCANHADR5_LENGTH               equ 0001h
SCANHADRL_SCANHADR5_MASK                 equ 0020h
SCANHADRL_SCANHADR6_POSN                 equ 0006h
SCANHADRL_SCANHADR6_POSITION             equ 0006h
SCANHADRL_SCANHADR6_SIZE                 equ 0001h
SCANHADRL_SCANHADR6_LENGTH               equ 0001h
SCANHADRL_SCANHADR6_MASK                 equ 0040h
SCANHADRL_SCANHADR7_POSN                 equ 0007h
SCANHADRL_SCANHADR7_POSITION             equ 0007h
SCANHADRL_SCANHADR7_SIZE                 equ 0001h
SCANHADRL_SCANHADR7_LENGTH               equ 0001h
SCANHADRL_SCANHADR7_MASK                 equ 0080h

