GopalSaraf/Practicals/PSDL/include/proc/pic16f18875.inc
// Register: CRCCON1
#define CRCCON1 CRCCON1
CRCCON1                                  equ 041Fh
// bitfield definitions
CRCCON1_PLEN_POSN                        equ 0000h
CRCCON1_PLEN_POSITION                    equ 0000h
CRCCON1_PLEN_SIZE                        equ 0004h
CRCCON1_PLEN_LENGTH                      equ 0004h
CRCCON1_PLEN_MASK                        equ 000Fh
CRCCON1_DLEN_POSN                        equ 0004h
CRCCON1_DLEN_POSITION                    equ 0004h
CRCCON1_DLEN_SIZE                        equ 0004h
CRCCON1_DLEN_LENGTH                      equ 0004h
CRCCON1_DLEN_MASK                        equ 00F0h
CRCCON1_PLEN0_POSN                       equ 0000h
CRCCON1_PLEN0_POSITION                   equ 0000h
CRCCON1_PLEN0_SIZE                       equ 0001h
CRCCON1_PLEN0_LENGTH                     equ 0001h
CRCCON1_PLEN0_MASK                       equ 0001h
CRCCON1_PLEN1_POSN                       equ 0001h
CRCCON1_PLEN1_POSITION                   equ 0001h
CRCCON1_PLEN1_SIZE                       equ 0001h
CRCCON1_PLEN1_LENGTH                     equ 0001h
CRCCON1_PLEN1_MASK                       equ 0002h
CRCCON1_PLEN2_POSN                       equ 0002h
CRCCON1_PLEN2_POSITION                   equ 0002h
CRCCON1_PLEN2_SIZE                       equ 0001h
CRCCON1_PLEN2_LENGTH                     equ 0001h
CRCCON1_PLEN2_MASK                       equ 0004h
CRCCON1_PLEN3_POSN                       equ 0003h
CRCCON1_PLEN3_POSITION                   equ 0003h
CRCCON1_PLEN3_SIZE                       equ 0001h
CRCCON1_PLEN3_LENGTH                     equ 0001h
CRCCON1_PLEN3_MASK                       equ 0008h
CRCCON1_DLEN0_POSN                       equ 0004h
CRCCON1_DLEN0_POSITION                   equ 0004h
CRCCON1_DLEN0_SIZE                       equ 0001h
CRCCON1_DLEN0_LENGTH                     equ 0001h
CRCCON1_DLEN0_MASK                       equ 0010h
CRCCON1_DLEN1_POSN                       equ 0005h
CRCCON1_DLEN1_POSITION                   equ 0005h
CRCCON1_DLEN1_SIZE                       equ 0001h
CRCCON1_DLEN1_LENGTH                     equ 0001h
CRCCON1_DLEN1_MASK                       equ 0020h
CRCCON1_DLEN2_POSN                       equ 0006h
CRCCON1_DLEN2_POSITION                   equ 0006h
CRCCON1_DLEN2_SIZE                       equ 0001h
CRCCON1_DLEN2_LENGTH                     equ 0001h
CRCCON1_DLEN2_MASK                       equ 0040h
CRCCON1_DLEN3_POSN                       equ 0007h
CRCCON1_DLEN3_POSITION                   equ 0007h
CRCCON1_DLEN3_SIZE                       equ 0001h
CRCCON1_DLEN3_LENGTH                     equ 0001h
CRCCON1_DLEN3_MASK                       equ 0080h

// Register: SMT1TMRL
#define SMT1TMRL SMT1TMRL
SMT1TMRL                                 equ 048Ch
// bitfield definitions
SMT1TMRL_TMR_POSN                        equ 0000h
SMT1TMRL_TMR_POSITION                    equ 0000h
SMT1TMRL_TMR_SIZE                        equ 0008h
SMT1TMRL_TMR_LENGTH                      equ 0008h
SMT1TMRL_TMR_MASK                        equ 00FFh
SMT1TMRL_TMR0_POSN                       equ 0000h
SMT1TMRL_TMR0_POSITION                   equ 0000h
SMT1TMRL_TMR0_SIZE                       equ 0001h
SMT1TMRL_TMR0_LENGTH                     equ 0001h
SMT1TMRL_TMR0_MASK                       equ 0001h
SMT1TMRL_TMR1_POSN                       equ 0001h
SMT1TMRL_TMR1_POSITION                   equ 0001h
SMT1TMRL_TMR1_SIZE                       equ 0001h
SMT1TMRL_TMR1_LENGTH                     equ 0001h
SMT1TMRL_TMR1_MASK                       equ 0002h
SMT1TMRL_TMR2_POSN                       equ 0002h
SMT1TMRL_TMR2_POSITION                   equ 0002h
SMT1TMRL_TMR2_SIZE                       equ 0001h
SMT1TMRL_TMR2_LENGTH                     equ 0001h
SMT1TMRL_TMR2_MASK                       equ 0004h
SMT1TMRL_TMR3_POSN                       equ 0003h
SMT1TMRL_TMR3_POSITION                   equ 0003h
SMT1TMRL_TMR3_SIZE                       equ 0001h
SMT1TMRL_TMR3_LENGTH                     equ 0001h
SMT1TMRL_TMR3_MASK                       equ 0008h
SMT1TMRL_TMR4_POSN                       equ 0004h
SMT1TMRL_TMR4_POSITION                   equ 0004h
SMT1TMRL_TMR4_SIZE                       equ 0001h
SMT1TMRL_TMR4_LENGTH                     equ 0001h
SMT1TMRL_TMR4_MASK                       equ 0010h
SMT1TMRL_TMR5_POSN                       equ 0005h
SMT1TMRL_TMR5_POSITION                   equ 0005h
SMT1TMRL_TMR5_SIZE                       equ 0001h
SMT1TMRL_TMR5_LENGTH                     equ 0001h
SMT1TMRL_TMR5_MASK                       equ 0020h
SMT1TMRL_TMR6_POSN                       equ 0006h
SMT1TMRL_TMR6_POSITION                   equ 0006h
SMT1TMRL_TMR6_SIZE                       equ 0001h
SMT1TMRL_TMR6_LENGTH                     equ 0001h
SMT1TMRL_TMR6_MASK                       equ 0040h
SMT1TMRL_TMR7_POSN                       equ 0007h
SMT1TMRL_TMR7_POSITION                   equ 0007h
SMT1TMRL_TMR7_SIZE                       equ 0001h
SMT1TMRL_TMR7_LENGTH                     equ 0001h
SMT1TMRL_TMR7_MASK                       equ 0080h
SMT1TMRL_SMT1TMR_POSN                    equ 0000h
SMT1TMRL_SMT1TMR_POSITION                equ 0000h
SMT1TMRL_SMT1TMR_SIZE                    equ 0008h
SMT1TMRL_SMT1TMR_LENGTH                  equ 0008h
SMT1TMRL_SMT1TMR_MASK                    equ 00FFh
SMT1TMRL_SMT1TMR0_POSN                   equ 0000h
SMT1TMRL_SMT1TMR0_POSITION               equ 0000h
SMT1TMRL_SMT1TMR0_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR0_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR0_MASK                   equ 0001h
SMT1TMRL_SMT1TMR1_POSN                   equ 0001h
SMT1TMRL_SMT1TMR1_POSITION               equ 0001h
SMT1TMRL_SMT1TMR1_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR1_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR1_MASK                   equ 0002h
SMT1TMRL_SMT1TMR2_POSN                   equ 0002h
SMT1TMRL_SMT1TMR2_POSITION               equ 0002h
SMT1TMRL_SMT1TMR2_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR2_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR2_MASK                   equ 0004h
SMT1TMRL_SMT1TMR3_POSN                   equ 0003h
SMT1TMRL_SMT1TMR3_POSITION               equ 0003h
SMT1TMRL_SMT1TMR3_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR3_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR3_MASK                   equ 0008h
SMT1TMRL_SMT1TMR4_POSN                   equ 0004h
SMT1TMRL_SMT1TMR4_POSITION               equ 0004h
SMT1TMRL_SMT1TMR4_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR4_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR4_MASK                   equ 0010h
SMT1TMRL_SMT1TMR5_POSN                   equ 0005h
SMT1TMRL_SMT1TMR5_POSITION               equ 0005h
SMT1TMRL_SMT1TMR5_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR5_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR5_MASK                   equ 0020h
SMT1TMRL_SMT1TMR6_POSN                   equ 0006h
SMT1TMRL_SMT1TMR6_POSITION               equ 0006h
SMT1TMRL_SMT1TMR6_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR6_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR6_MASK                   equ 0040h
SMT1TMRL_SMT1TMR7_POSN                   equ 0007h
SMT1TMRL_SMT1TMR7_POSITION               equ 0007h
SMT1TMRL_SMT1TMR7_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR7_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR7_MASK                   equ 0080h

// Register: SMT1TMRH
#define SMT1TMRH SMT1TMRH
SMT1TMRH                                 equ 048Dh
// bitfield definitions
SMT1TMRH_TMR_POSN                        equ 0000h
SMT1TMRH_TMR_POSITION                    equ 0000h
SMT1TMRH_TMR_SIZE                        equ 0008h
SMT1TMRH_TMR_LENGTH                      equ 0008h
SMT1TMRH_TMR_MASK                        equ 00FFh
SMT1TMRH_TMR8_POSN                       equ 0000h
SMT1TMRH_TMR8_POSITION                   equ 0000h
SMT1TMRH_TMR8_SIZE                       equ 0001h
SMT1TMRH_TMR8_LENGTH                     equ 0001h
SMT1TMRH_TMR8_MASK                       equ 0001h
SMT1TMRH_TMR9_POSN                       equ 0001h
SMT1TMRH_TMR9_POSITION                   equ 0001h
SMT1TMRH_TMR9_SIZE                       equ 0001h
SMT1TMRH_TMR9_LENGTH                     equ 0001h
SMT1TMRH_TMR9_MASK                       equ 0002h
SMT1TMRH_TMR10_POSN                      equ 0002h
SMT1TMRH_TMR10_POSITION                  equ 0002h
SMT1TMRH_TMR10_SIZE                      equ 0001h
SMT1TMRH_TMR10_LENGTH                    equ 0001h
SMT1TMRH_TMR10_MASK                      equ 0004h
SMT1TMRH_TMR11_POSN                      equ 0003h
SMT1TMRH_TMR11_POSITION                  equ 0003h
SMT1TMRH_TMR11_SIZE                      equ 0001h
SMT1TMRH_TMR11_LENGTH                    equ 0001h
SMT1TMRH_TMR11_MASK                      equ 0008h
SMT1TMRH_TMR12_POSN                      equ 0004h
SMT1TMRH_TMR12_POSITION                  equ 0004h
SMT1TMRH_TMR12_SIZE                      equ 0001h
SMT1TMRH_TMR12_LENGTH                    equ 0001h
SMT1TMRH_TMR12_MASK                      equ 0010h
SMT1TMRH_TMR13_POSN                      equ 0005h
SMT1TMRH_TMR13_POSITION                  equ 0005h
SMT1TMRH_TMR13_SIZE                      equ 0001h
SMT1TMRH_TMR13_LENGTH                    equ 0001h
SMT1TMRH_TMR13_MASK                      equ 0020h
SMT1TMRH_TMR14_POSN                      equ 0006h
SMT1TMRH_TMR14_POSITION                  equ 0006h
SMT1TMRH_TMR14_SIZE                      equ 0001h
SMT1TMRH_TMR14_LENGTH                    equ 0001h
SMT1TMRH_TMR14_MASK                      equ 0040h
SMT1TMRH_TMR15_POSN                      equ 0007h
SMT1TMRH_TMR15_POSITION                  equ 0007h
SMT1TMRH_TMR15_SIZE                      equ 0001h
SMT1TMRH_TMR15_LENGTH                    equ 0001h
SMT1TMRH_TMR15_MASK                      equ 0080h
SMT1TMRH_SMT1TMR_POSN                    equ 0000h
SMT1TMRH_SMT1TMR_POSITION                equ 0000h
SMT1TMRH_SMT1TMR_SIZE                    equ 0008h
SMT1TMRH_SMT1TMR_LENGTH                  equ 0008h
SMT1TMRH_SMT1TMR_MASK                    equ 00FFh
SMT1TMRH_SMT1TMR8_POSN                   equ 0000h
SMT1TMRH_SMT1TMR8_POSITION               equ 0000h
SMT1TMRH_SMT1TMR8_SIZE                   equ 0001h
SMT1TMRH_SMT1TMR8_LENGTH                 equ 0001h
SMT1TMRH_SMT1TMR8_MASK                   equ 0001h
SMT1TMRH_SMT1TMR9_POSN                   equ 0001h
SMT1TMRH_SMT1TMR9_POSITION               equ 0001h
SMT1TMRH_SMT1TMR9_SIZE                   equ 0001h
SMT1TMRH_SMT1TMR9_LENGTH                 equ 0001h
SMT1TMRH_SMT1TMR9_MASK                   equ 0002h
SMT1TMRH_SMT1TMR10_POSN                  equ 0002h
SMT1TMRH_SMT1TMR10_POSITION              equ 0002h
SMT1TMRH_SMT1TMR10_SIZE                  equ 0001h
SMT1TMRH_SMT1TMR10_LENGTH                equ 0001h
SMT1TMRH_SMT1TMR10_MASK                  equ 0004h
SMT1TMRH_SMT1TMR11_POSN                  equ 0003h
SMT1TMRH_SMT1TMR11_POSITION              equ 0003h
SMT1TMRH_SMT1TMR11_SIZE                  equ 0001h
SMT1TMRH_SMT1TMR11_LENGTH                equ 0001h
SMT1TMRH_SMT1TMR11_MASK                  equ 0008h
SMT1TMRH_SMT1TMR12_POSN                  equ 0004h
SMT1TMRH_SMT1TMR12_POSITION              equ 0004h
SMT1TMRH_SMT1TMR12_SIZE                  equ 0001h
SMT1TMRH_SMT1TMR12_LENGTH                equ 0001h
SMT1TMRH_SMT1TMR12_MASK                  equ 0010h
SMT1TMRH_SMT1TMR13_POSN                  equ 0005h
SMT1TMRH_SMT1TMR13_POSITION              equ 0005h
SMT1TMRH_SMT1TMR13_SIZE                  equ 0001h
SMT1TMRH_SMT1TMR13_LENGTH                equ 0001h
SMT1TMRH_SMT1TMR13_MASK                  equ 0020h
SMT1TMRH_SMT1TMR14_POSN                  equ 0006h
SMT1TMRH_SMT1TMR14_POSITION              equ 0006h
SMT1TMRH_SMT1TMR14_SIZE                  equ 0001h
SMT1TMRH_SMT1TMR14_LENGTH                equ 0001h
SMT1TMRH_SMT1TMR14_MASK                  equ 0040h
SMT1TMRH_SMT1TMR15_POSN                  equ 0007h
SMT1TMRH_SMT1TMR15_POSITION              equ 0007h
SMT1TMRH_SMT1TMR15_SIZE                  equ 0001h
SMT1TMRH_SMT1TMR15_LENGTH                equ 0001h
SMT1TMRH_SMT1TMR15_MASK                  equ 0080h

