GopalSaraf/Practicals/PSDL/include/proc/pic16f18875.inc
// Register: CCDNB
#define CCDNB CCDNB
CCDNB                                    equ 0F4Bh
// bitfield definitions
CCDNB_CCDNB0_POSN                        equ 0000h
CCDNB_CCDNB0_POSITION                    equ 0000h
CCDNB_CCDNB0_SIZE                        equ 0001h
CCDNB_CCDNB0_LENGTH                      equ 0001h
CCDNB_CCDNB0_MASK                        equ 0001h
CCDNB_CCDNB1_POSN                        equ 0001h
CCDNB_CCDNB1_POSITION                    equ 0001h
CCDNB_CCDNB1_SIZE                        equ 0001h
CCDNB_CCDNB1_LENGTH                      equ 0001h
CCDNB_CCDNB1_MASK                        equ 0002h
CCDNB_CCDNB2_POSN                        equ 0002h
CCDNB_CCDNB2_POSITION                    equ 0002h
CCDNB_CCDNB2_SIZE                        equ 0001h
CCDNB_CCDNB2_LENGTH                      equ 0001h
CCDNB_CCDNB2_MASK                        equ 0004h
CCDNB_CCDNB3_POSN                        equ 0003h
CCDNB_CCDNB3_POSITION                    equ 0003h
CCDNB_CCDNB3_SIZE                        equ 0001h
CCDNB_CCDNB3_LENGTH                      equ 0001h
CCDNB_CCDNB3_MASK                        equ 0008h
CCDNB_CCDNB4_POSN                        equ 0004h
CCDNB_CCDNB4_POSITION                    equ 0004h
CCDNB_CCDNB4_SIZE                        equ 0001h
CCDNB_CCDNB4_LENGTH                      equ 0001h
CCDNB_CCDNB4_MASK                        equ 0010h
CCDNB_CCDNB5_POSN                        equ 0005h
CCDNB_CCDNB5_POSITION                    equ 0005h
CCDNB_CCDNB5_SIZE                        equ 0001h
CCDNB_CCDNB5_LENGTH                      equ 0001h
CCDNB_CCDNB5_MASK                        equ 0020h
CCDNB_CCDNB6_POSN                        equ 0006h
CCDNB_CCDNB6_POSITION                    equ 0006h
CCDNB_CCDNB6_SIZE                        equ 0001h
CCDNB_CCDNB6_LENGTH                      equ 0001h
CCDNB_CCDNB6_MASK                        equ 0040h
CCDNB_CCDNB7_POSN                        equ 0007h
CCDNB_CCDNB7_POSITION                    equ 0007h
CCDNB_CCDNB7_SIZE                        equ 0001h
CCDNB_CCDNB7_LENGTH                      equ 0001h
CCDNB_CCDNB7_MASK                        equ 0080h

// Register: CCDPB
#define CCDPB CCDPB
CCDPB                                    equ 0F4Ch
// bitfield definitions
CCDPB_CCDPB0_POSN                        equ 0000h
CCDPB_CCDPB0_POSITION                    equ 0000h
CCDPB_CCDPB0_SIZE                        equ 0001h
CCDPB_CCDPB0_LENGTH                      equ 0001h
CCDPB_CCDPB0_MASK                        equ 0001h
CCDPB_CCDPB1_POSN                        equ 0001h
CCDPB_CCDPB1_POSITION                    equ 0001h
CCDPB_CCDPB1_SIZE                        equ 0001h
CCDPB_CCDPB1_LENGTH                      equ 0001h
CCDPB_CCDPB1_MASK                        equ 0002h
CCDPB_CCDPB2_POSN                        equ 0002h
CCDPB_CCDPB2_POSITION                    equ 0002h
CCDPB_CCDPB2_SIZE                        equ 0001h
CCDPB_CCDPB2_LENGTH                      equ 0001h
CCDPB_CCDPB2_MASK                        equ 0004h
CCDPB_CCDPB3_POSN                        equ 0003h
CCDPB_CCDPB3_POSITION                    equ 0003h
CCDPB_CCDPB3_SIZE                        equ 0001h
CCDPB_CCDPB3_LENGTH                      equ 0001h
CCDPB_CCDPB3_MASK                        equ 0008h
CCDPB_CCDPB4_POSN                        equ 0004h
CCDPB_CCDPB4_POSITION                    equ 0004h
CCDPB_CCDPB4_SIZE                        equ 0001h
CCDPB_CCDPB4_LENGTH                      equ 0001h
CCDPB_CCDPB4_MASK                        equ 0010h
CCDPB_CCDPB5_POSN                        equ 0005h
CCDPB_CCDPB5_POSITION                    equ 0005h
CCDPB_CCDPB5_SIZE                        equ 0001h
CCDPB_CCDPB5_LENGTH                      equ 0001h
CCDPB_CCDPB5_MASK                        equ 0020h
CCDPB_CCDPB6_POSN                        equ 0006h
CCDPB_CCDPB6_POSITION                    equ 0006h
CCDPB_CCDPB6_SIZE                        equ 0001h
CCDPB_CCDPB6_LENGTH                      equ 0001h
CCDPB_CCDPB6_MASK                        equ 0040h
CCDPB_CCDPB7_POSN                        equ 0007h
CCDPB_CCDPB7_POSITION                    equ 0007h
CCDPB_CCDPB7_SIZE                        equ 0001h
CCDPB_CCDPB7_LENGTH                      equ 0001h
CCDPB_CCDPB7_MASK                        equ 0080h

// Register: ANSELC
#define ANSELC ANSELC
ANSELC                                   equ 0F4Eh
// bitfield definitions
ANSELC_ANSC0_POSN                        equ 0000h
ANSELC_ANSC0_POSITION                    equ 0000h
ANSELC_ANSC0_SIZE                        equ 0001h
ANSELC_ANSC0_LENGTH                      equ 0001h
ANSELC_ANSC0_MASK                        equ 0001h
ANSELC_ANSC1_POSN                        equ 0001h
ANSELC_ANSC1_POSITION                    equ 0001h
ANSELC_ANSC1_SIZE                        equ 0001h
ANSELC_ANSC1_LENGTH                      equ 0001h
ANSELC_ANSC1_MASK                        equ 0002h
ANSELC_ANSC2_POSN                        equ 0002h
ANSELC_ANSC2_POSITION                    equ 0002h
ANSELC_ANSC2_SIZE                        equ 0001h
ANSELC_ANSC2_LENGTH                      equ 0001h
ANSELC_ANSC2_MASK                        equ 0004h
ANSELC_ANSC3_POSN                        equ 0003h
ANSELC_ANSC3_POSITION                    equ 0003h
ANSELC_ANSC3_SIZE                        equ 0001h
ANSELC_ANSC3_LENGTH                      equ 0001h
ANSELC_ANSC3_MASK                        equ 0008h
ANSELC_ANSC4_POSN                        equ 0004h
ANSELC_ANSC4_POSITION                    equ 0004h
ANSELC_ANSC4_SIZE                        equ 0001h
ANSELC_ANSC4_LENGTH                      equ 0001h
ANSELC_ANSC4_MASK                        equ 0010h
ANSELC_ANSC5_POSN                        equ 0005h
ANSELC_ANSC5_POSITION                    equ 0005h
ANSELC_ANSC5_SIZE                        equ 0001h
ANSELC_ANSC5_LENGTH                      equ 0001h
ANSELC_ANSC5_MASK                        equ 0020h
ANSELC_ANSC6_POSN                        equ 0006h
ANSELC_ANSC6_POSITION                    equ 0006h
ANSELC_ANSC6_SIZE                        equ 0001h
ANSELC_ANSC6_LENGTH                      equ 0001h
ANSELC_ANSC6_MASK                        equ 0040h
ANSELC_ANSC7_POSN                        equ 0007h
ANSELC_ANSC7_POSITION                    equ 0007h
ANSELC_ANSC7_SIZE                        equ 0001h
ANSELC_ANSC7_LENGTH                      equ 0001h
ANSELC_ANSC7_MASK                        equ 0080h

