GopalSaraf/Practicals/PSDL/include/proc/pic16f18875.inc
#define SLRA0                            BANKMASK(SLRCONA), 0
#define SLRA1                            BANKMASK(SLRCONA), 1
#define SLRA2                            BANKMASK(SLRCONA), 2
#define SLRA3                            BANKMASK(SLRCONA), 3
#define SLRA4                            BANKMASK(SLRCONA), 4
#define SLRA5                            BANKMASK(SLRCONA), 5
#define SLRA6                            BANKMASK(SLRCONA), 6
#define SLRA7                            BANKMASK(SLRCONA), 7
#define SLRB0                            BANKMASK(SLRCONB), 0
#define SLRB1                            BANKMASK(SLRCONB), 1
#define SLRB2                            BANKMASK(SLRCONB), 2
#define SLRB3                            BANKMASK(SLRCONB), 3
#define SLRB4                            BANKMASK(SLRCONB), 4
#define SLRB5                            BANKMASK(SLRCONB), 5
#define SLRB6                            BANKMASK(SLRCONB), 6
#define SLRB7                            BANKMASK(SLRCONB), 7
#define SLRC0                            BANKMASK(SLRCONC), 0
#define SLRC1                            BANKMASK(SLRCONC), 1
#define SLRC2                            BANKMASK(SLRCONC), 2
#define SLRC3                            BANKMASK(SLRCONC), 3
#define SLRC4                            BANKMASK(SLRCONC), 4
#define SLRC5                            BANKMASK(SLRCONC), 5
#define SLRC6                            BANKMASK(SLRCONC), 6
#define SLRC7                            BANKMASK(SLRCONC), 7
#define SLRD0                            BANKMASK(SLRCOND), 0
#define SLRD1                            BANKMASK(SLRCOND), 1
#define SLRD2                            BANKMASK(SLRCOND), 2
#define SLRD3                            BANKMASK(SLRCOND), 3
#define SLRD4                            BANKMASK(SLRCOND), 4
#define SLRD5                            BANKMASK(SLRCOND), 5
#define SLRD6                            BANKMASK(SLRCOND), 6
#define SLRD7                            BANKMASK(SLRCOND), 7
#define SLRE0                            BANKMASK(SLRCONE), 0
#define SLRE1                            BANKMASK(SLRCONE), 1
#define SLRE2                            BANKMASK(SLRCONE), 2
#define SMP1                             BANKMASK(SSP1STAT), 7
#define SMP2                             BANKMASK(SSP2STAT), 7
#define SMT1AS                           BANKMASK(SMT1STAT), 0
#define SMT1CPOL                         BANKMASK(SMT1CON0), 2
#define SMT1CPR0                         BANKMASK(SMT1CPRL), 0
#define SMT1CPR1                         BANKMASK(SMT1CPRL), 1
#define SMT1CPR10                        BANKMASK(SMT1CPRH), 2
#define SMT1CPR11                        BANKMASK(SMT1CPRH), 3
#define SMT1CPR12                        BANKMASK(SMT1CPRH), 4
#define SMT1CPR13                        BANKMASK(SMT1CPRH), 5
#define SMT1CPR14                        BANKMASK(SMT1CPRH), 6
#define SMT1CPR15                        BANKMASK(SMT1CPRH), 7
#define SMT1CPR16                        BANKMASK(SMT1CPRU), 0
#define SMT1CPR17                        BANKMASK(SMT1CPRU), 1
#define SMT1CPR18                        BANKMASK(SMT1CPRU), 2
#define SMT1CPR19                        BANKMASK(SMT1CPRU), 3
#define SMT1CPR2                         BANKMASK(SMT1CPRL), 2
#define SMT1CPR20                        BANKMASK(SMT1CPRU), 4
#define SMT1CPR21                        BANKMASK(SMT1CPRU), 5
#define SMT1CPR22                        BANKMASK(SMT1CPRU), 6
#define SMT1CPR23                        BANKMASK(SMT1CPRU), 7
#define SMT1CPR3                         BANKMASK(SMT1CPRL), 3
#define SMT1CPR4                         BANKMASK(SMT1CPRL), 4
#define SMT1CPR5                         BANKMASK(SMT1CPRL), 5
#define SMT1CPR6                         BANKMASK(SMT1CPRL), 6
#define SMT1CPR7                         BANKMASK(SMT1CPRL), 7
#define SMT1CPR8                         BANKMASK(SMT1CPRH), 0
#define SMT1CPR9                         BANKMASK(SMT1CPRH), 1
#define SMT1CPRUP                        BANKMASK(SMT1STAT), 7
#define SMT1CPW0                         BANKMASK(SMT1CPWL), 0
#define SMT1CPW1                         BANKMASK(SMT1CPWL), 1
#define SMT1CPW10                        BANKMASK(SMT1CPWH), 2
#define SMT1CPW11                        BANKMASK(SMT1CPWH), 3
#define SMT1CPW12                        BANKMASK(SMT1CPWH), 4
#define SMT1CPW13                        BANKMASK(SMT1CPWH), 5
#define SMT1CPW14                        BANKMASK(SMT1CPWH), 6
#define SMT1CPW15                        BANKMASK(SMT1CPWH), 7
#define SMT1CPW16                        BANKMASK(SMT1CPWU), 0
#define SMT1CPW17                        BANKMASK(SMT1CPWU), 1
#define SMT1CPW18                        BANKMASK(SMT1CPWU), 2
#define SMT1CPW19                        BANKMASK(SMT1CPWU), 3
#define SMT1CPW2                         BANKMASK(SMT1CPWL), 2
#define SMT1CPW20                        BANKMASK(SMT1CPWU), 4
#define SMT1CPW21                        BANKMASK(SMT1CPWU), 5
#define SMT1CPW22                        BANKMASK(SMT1CPWU), 6
#define SMT1CPW23                        BANKMASK(SMT1CPWU), 7
#define SMT1CPW3                         BANKMASK(SMT1CPWL), 3
#define SMT1CPW4                         BANKMASK(SMT1CPWL), 4
#define SMT1CPW5                         BANKMASK(SMT1CPWL), 5
#define SMT1CPW6                         BANKMASK(SMT1CPWL), 6
#define SMT1CPW7                         BANKMASK(SMT1CPWL), 7
#define SMT1CPW8                         BANKMASK(SMT1CPWH), 0
#define SMT1CPW9                         BANKMASK(SMT1CPWH), 1
#define SMT1CPWUP                        BANKMASK(SMT1STAT), 6
#define SMT1CSEL0                        BANKMASK(SMT1CLK), 0
#define SMT1CSEL1                        BANKMASK(SMT1CLK), 1
#define SMT1CSEL2                        BANKMASK(SMT1CLK), 2
#define SMT1EN                           BANKMASK(SMT1CON0), 7
#define SMT1GO                           BANKMASK(SMT1CON1), 7
#define SMT1IE                           BANKMASK(PIE8), 0
#define SMT1IF                           BANKMASK(PIR8), 0
#define SMT1MD                           BANKMASK(PMD5), 6
#define SMT1PR0                          BANKMASK(SMT1PRL), 0
#define SMT1PR1                          BANKMASK(SMT1PRL), 1
#define SMT1PR10                         BANKMASK(SMT1PRH), 2
#define SMT1PR11                         BANKMASK(SMT1PRH), 3
#define SMT1PR12                         BANKMASK(SMT1PRH), 4
#define SMT1PR13                         BANKMASK(SMT1PRH), 5
#define SMT1PR14                         BANKMASK(SMT1PRH), 6
#define SMT1PR15                         BANKMASK(SMT1PRH), 7
#define SMT1PR16                         BANKMASK(SMT1PRU), 0
#define SMT1PR17                         BANKMASK(SMT1PRU), 1
#define SMT1PR18                         BANKMASK(SMT1PRU), 2
#define SMT1PR19                         BANKMASK(SMT1PRU), 3
#define SMT1PR2                          BANKMASK(SMT1PRL), 2
#define SMT1PR20                         BANKMASK(SMT1PRU), 4
#define SMT1PR21                         BANKMASK(SMT1PRU), 5
#define SMT1PR22                         BANKMASK(SMT1PRU), 6
#define SMT1PR23                         BANKMASK(SMT1PRU), 7
#define SMT1PR3                          BANKMASK(SMT1PRL), 3
#define SMT1PR4                          BANKMASK(SMT1PRL), 4
#define SMT1PR5                          BANKMASK(SMT1PRL), 5
#define SMT1PR6                          BANKMASK(SMT1PRL), 6
#define SMT1PR7                          BANKMASK(SMT1PRL), 7
#define SMT1PR8                          BANKMASK(SMT1PRH), 0
#define SMT1PR9                          BANKMASK(SMT1PRH), 1
#define SMT1PRAIE                        BANKMASK(PIE8), 1
#define SMT1PRAIF                        BANKMASK(PIR8), 1
#define SMT1PS0                          BANKMASK(SMT1CON0), 0
#define SMT1PS1                          BANKMASK(SMT1CON0), 1
#define SMT1PWAIE                        BANKMASK(PIE8), 2
#define SMT1PWAIF                        BANKMASK(PIR8), 2
#define SMT1REPEAT                       BANKMASK(SMT1CON1), 6
#define SMT1RESET                        BANKMASK(SMT1STAT), 5
#define SMT1RST                          BANKMASK(SMT1STAT), 5
#define SMT1SPOL                         BANKMASK(SMT1CON0), 3
#define SMT1SSEL0                        BANKMASK(SMT1SIG), 0
#define SMT1SSEL1                        BANKMASK(SMT1SIG), 1
#define SMT1SSEL2                        BANKMASK(SMT1SIG), 2
#define SMT1SSEL3                        BANKMASK(SMT1SIG), 3
#define SMT1SSEL4                        BANKMASK(SMT1SIG), 4
#define SMT1STP                          BANKMASK(SMT1CON0), 5
#define SMT1TMR0                         BANKMASK(SMT1TMRL), 0
#define SMT1TMR1                         BANKMASK(SMT1TMRL), 1
#define SMT1TMR10                        BANKMASK(SMT1TMRH), 2
#define SMT1TMR11                        BANKMASK(SMT1TMRH), 3
#define SMT1TMR12                        BANKMASK(SMT1TMRH), 4
#define SMT1TMR13                        BANKMASK(SMT1TMRH), 5
#define SMT1TMR14                        BANKMASK(SMT1TMRH), 6
#define SMT1TMR15                        BANKMASK(SMT1TMRH), 7
#define SMT1TMR16                        BANKMASK(SMT1TMRU), 0
#define SMT1TMR17                        BANKMASK(SMT1TMRU), 1
#define SMT1TMR18                        BANKMASK(SMT1TMRU), 2
#define SMT1TMR19                        BANKMASK(SMT1TMRU), 3
#define SMT1TMR2                         BANKMASK(SMT1TMRL), 2
#define SMT1TMR20                        BANKMASK(SMT1TMRU), 4
#define SMT1TMR21                        BANKMASK(SMT1TMRU), 5
#define SMT1TMR22                        BANKMASK(SMT1TMRU), 6
#define SMT1TMR23                        BANKMASK(SMT1TMRU), 7
#define SMT1TMR3                         BANKMASK(SMT1TMRL), 3
#define SMT1TMR4                         BANKMASK(SMT1TMRL), 4
#define SMT1TMR5                         BANKMASK(SMT1TMRL), 5
#define SMT1TMR6                         BANKMASK(SMT1TMRL), 6
#define SMT1TMR7                         BANKMASK(SMT1TMRL), 7
#define SMT1TMR8                         BANKMASK(SMT1TMRH), 0
#define SMT1TMR9                         BANKMASK(SMT1TMRH), 1
#define SMT1TS                           BANKMASK(SMT1STAT), 2
#define SMT1WOL                          BANKMASK(SMT1CON0), 4
#define SMT1WS                           BANKMASK(SMT1STAT), 1
#define SMT1WSEL0                        BANKMASK(SMT1WIN), 0
#define SMT1WSEL1                        BANKMASK(SMT1WIN), 1
#define SMT1WSEL2                        BANKMASK(SMT1WIN), 2
#define SMT1WSEL3                        BANKMASK(SMT1WIN), 3
#define SMT1WSEL4                        BANKMASK(SMT1WIN), 4
#define SMT2AS                           BANKMASK(SMT2STAT), 0
#define SMT2CPOL                         BANKMASK(SMT2CON0), 2
#define SMT2CPR0                         BANKMASK(SMT2CPRL), 0
#define SMT2CPR1                         BANKMASK(SMT2CPRL), 1
#define SMT2CPR10                        BANKMASK(SMT2CPRH), 2
#define SMT2CPR11                        BANKMASK(SMT2CPRH), 3
#define SMT2CPR12                        BANKMASK(SMT2CPRH), 4
#define SMT2CPR13                        BANKMASK(SMT2CPRH), 5
#define SMT2CPR14                        BANKMASK(SMT2CPRH), 6
#define SMT2CPR15                        BANKMASK(SMT2CPRH), 7
#define SMT2CPR16                        BANKMASK(SMT2CPRU), 0
#define SMT2CPR17                        BANKMASK(SMT2CPRU), 1
#define SMT2CPR18                        BANKMASK(SMT2CPRU), 2
#define SMT2CPR19                        BANKMASK(SMT2CPRU), 3
#define SMT2CPR2                         BANKMASK(SMT2CPRL), 2
#define SMT2CPR20                        BANKMASK(SMT2CPRU), 4
#define SMT2CPR21                        BANKMASK(SMT2CPRU), 5
#define SMT2CPR22                        BANKMASK(SMT2CPRU), 6
#define SMT2CPR23                        BANKMASK(SMT2CPRU), 7
#define SMT2CPR3                         BANKMASK(SMT2CPRL), 3
#define SMT2CPR4                         BANKMASK(SMT2CPRL), 4
#define SMT2CPR5                         BANKMASK(SMT2CPRL), 5
#define SMT2CPR6                         BANKMASK(SMT2CPRL), 6
#define SMT2CPR7                         BANKMASK(SMT2CPRL), 7
#define SMT2CPR8                         BANKMASK(SMT2CPRH), 0
#define SMT2CPR9                         BANKMASK(SMT2CPRH), 1
#define SMT2CPRUP                        BANKMASK(SMT2STAT), 7
#define SMT2CPW0                         BANKMASK(SMT2CPWL), 0
#define SMT2CPW1                         BANKMASK(SMT2CPWL), 1
#define SMT2CPW10                        BANKMASK(SMT2CPWH), 2
#define SMT2CPW11                        BANKMASK(SMT2CPWH), 3
#define SMT2CPW12                        BANKMASK(SMT2CPWH), 4
#define SMT2CPW13                        BANKMASK(SMT2CPWH), 5
#define SMT2CPW14                        BANKMASK(SMT2CPWH), 6
#define SMT2CPW15                        BANKMASK(SMT2CPWH), 7
#define SMT2CPW16                        BANKMASK(SMT2CPWU), 0
#define SMT2CPW17                        BANKMASK(SMT2CPWU), 1
#define SMT2CPW18                        BANKMASK(SMT2CPWU), 2
#define SMT2CPW19                        BANKMASK(SMT2CPWU), 3
#define SMT2CPW2                         BANKMASK(SMT2CPWL), 2
#define SMT2CPW20                        BANKMASK(SMT2CPWU), 4
#define SMT2CPW21                        BANKMASK(SMT2CPWU), 5
#define SMT2CPW22                        BANKMASK(SMT2CPWU), 6
#define SMT2CPW23                        BANKMASK(SMT2CPWU), 7
#define SMT2CPW3                         BANKMASK(SMT2CPWL), 3
#define SMT2CPW4                         BANKMASK(SMT2CPWL), 4
#define SMT2CPW5                         BANKMASK(SMT2CPWL), 5
#define SMT2CPW6                         BANKMASK(SMT2CPWL), 6
#define SMT2CPW7                         BANKMASK(SMT2CPWL), 7
#define SMT2CPW8                         BANKMASK(SMT2CPWH), 0
#define SMT2CPW9                         BANKMASK(SMT2CPWH), 1
#define SMT2CPWUP                        BANKMASK(SMT2STAT), 6
#define SMT2CSEL0                        BANKMASK(SMT2CLK), 0
#define SMT2CSEL1                        BANKMASK(SMT2CLK), 1
#define SMT2CSEL2                        BANKMASK(SMT2CLK), 2
#define SMT2EN                           BANKMASK(SMT2CON0), 7
#define SMT2GO                           BANKMASK(SMT2CON1), 7
#define SMT2IE                           BANKMASK(PIE8), 3
#define SMT2IF                           BANKMASK(PIR8), 3
#define SMT2MD                           BANKMASK(PMD5), 7
#define SMT2PR0                          BANKMASK(SMT2PRL), 0
#define SMT2PR1                          BANKMASK(SMT2PRL), 1
#define SMT2PR10                         BANKMASK(SMT2PRH), 2
#define SMT2PR11                         BANKMASK(SMT2PRH), 3
#define SMT2PR12                         BANKMASK(SMT2PRH), 4
#define SMT2PR13                         BANKMASK(SMT2PRH), 5
#define SMT2PR14                         BANKMASK(SMT2PRH), 6
#define SMT2PR15                         BANKMASK(SMT2PRH), 7
#define SMT2PR16                         BANKMASK(SMT2PRU), 0
#define SMT2PR17                         BANKMASK(SMT2PRU), 1
#define SMT2PR18                         BANKMASK(SMT2PRU), 2
#define SMT2PR19                         BANKMASK(SMT2PRU), 3
#define SMT2PR2                          BANKMASK(SMT2PRL), 2
#define SMT2PR20                         BANKMASK(SMT2PRU), 4
#define SMT2PR21                         BANKMASK(SMT2PRU), 5
#define SMT2PR22                         BANKMASK(SMT2PRU), 6
#define SMT2PR23                         BANKMASK(SMT2PRU), 7
#define SMT2PR3                          BANKMASK(SMT2PRL), 3
#define SMT2PR4                          BANKMASK(SMT2PRL), 4
#define SMT2PR5                          BANKMASK(SMT2PRL), 5
#define SMT2PR6                          BANKMASK(SMT2PRL), 6
#define SMT2PR7                          BANKMASK(SMT2PRL), 7
#define SMT2PR8                          BANKMASK(SMT2PRH), 0
#define SMT2PR9                          BANKMASK(SMT2PRH), 1
#define SMT2PRAIE                        BANKMASK(PIE8), 4
#define SMT2PRAIF                        BANKMASK(PIR8), 4
#define SMT2PS0                          BANKMASK(SMT2CON0), 0
#define SMT2PS1                          BANKMASK(SMT2CON0), 1
#define SMT2PWAIE                        BANKMASK(PIE8), 5
#define SMT2PWAIF                        BANKMASK(PIR8), 5
#define SMT2REPEAT                       BANKMASK(SMT2CON1), 6
#define SMT2RESET                        BANKMASK(SMT2STAT), 5
#define SMT2RST                          BANKMASK(SMT2STAT), 5
#define SMT2SPOL                         BANKMASK(SMT2CON0), 3
#define SMT2SSEL0                        BANKMASK(SMT2SIG), 0
#define SMT2SSEL1                        BANKMASK(SMT2SIG), 1
#define SMT2SSEL2                        BANKMASK(SMT2SIG), 2
#define SMT2SSEL3                        BANKMASK(SMT2SIG), 3
#define SMT2SSEL4                        BANKMASK(SMT2SIG), 4
#define SMT2STP                          BANKMASK(SMT2CON0), 5
#define SMT2TMR0                         BANKMASK(SMT2TMRL), 0
#define SMT2TMR1                         BANKMASK(SMT2TMRL), 1
#define SMT2TMR10                        BANKMASK(SMT2TMRH), 2
#define SMT2TMR11                        BANKMASK(SMT2TMRH), 3
#define SMT2TMR12                        BANKMASK(SMT2TMRH), 4
#define SMT2TMR13                        BANKMASK(SMT2TMRH), 5
#define SMT2TMR14                        BANKMASK(SMT2TMRH), 6
#define SMT2TMR15                        BANKMASK(SMT2TMRH), 7
#define SMT2TMR16                        BANKMASK(SMT2TMRU), 0
#define SMT2TMR17                        BANKMASK(SMT2TMRU), 1
#define SMT2TMR18                        BANKMASK(SMT2TMRU), 2
#define SMT2TMR19                        BANKMASK(SMT2TMRU), 3
#define SMT2TMR2                         BANKMASK(SMT2TMRL), 2
#define SMT2TMR20                        BANKMASK(SMT2TMRU), 4
#define SMT2TMR21                        BANKMASK(SMT2TMRU), 5
#define SMT2TMR22                        BANKMASK(SMT2TMRU), 6
#define SMT2TMR23                        BANKMASK(SMT2TMRU), 7
#define SMT2TMR3                         BANKMASK(SMT2TMRL), 3
#define SMT2TMR4                         BANKMASK(SMT2TMRL), 4
#define SMT2TMR5                         BANKMASK(SMT2TMRL), 5
#define SMT2TMR6                         BANKMASK(SMT2TMRL), 6
#define SMT2TMR7                         BANKMASK(SMT2TMRL), 7
#define SMT2TMR8                         BANKMASK(SMT2TMRH), 0
#define SMT2TMR9                         BANKMASK(SMT2TMRH), 1
#define SMT2TS                           BANKMASK(SMT2STAT), 2
#define SMT2WOL                          BANKMASK(SMT2CON0), 4
#define SMT2WS                           BANKMASK(SMT2STAT), 1
#define SMT2WSEL0                        BANKMASK(SMT2WIN), 0
#define SMT2WSEL1                        BANKMASK(SMT2WIN), 1
#define SMT2WSEL2                        BANKMASK(SMT2WIN), 2
#define SMT2WSEL3                        BANKMASK(SMT2WIN), 3
#define SMT2WSEL4                        BANKMASK(SMT2WIN), 4
#define SMU1SIGPPS0                      BANKMASK(SMT1SIGPPS), 0
#define SMU1SIGPPS1                      BANKMASK(SMT1SIGPPS), 1
#define SMU1SIGPPS2                      BANKMASK(SMT1SIGPPS), 2
#define SMU1SIGPPS3                      BANKMASK(SMT1SIGPPS), 3
#define SMU1SIGPPS4                      BANKMASK(SMT1SIGPPS), 4
#define SMU1WINPPS0                      BANKMASK(SMT1WINPPS), 0
#define SMU1WINPPS1                      BANKMASK(SMT1WINPPS), 1
#define SMU1WINPPS2                      BANKMASK(SMT1WINPPS), 2
#define SMU1WINPPS3                      BANKMASK(SMT1WINPPS), 3
#define SMU1WINPPS4                      BANKMASK(SMT1WINPPS), 4
#define SMU2SIGPPS0                      BANKMASK(SMT2SIGPPS), 0
#define SMU2SIGPPS1                      BANKMASK(SMT2SIGPPS), 1
#define SMU2SIGPPS2                      BANKMASK(SMT2SIGPPS), 2
#define SMU2SIGPPS3                      BANKMASK(SMT2SIGPPS), 3
#define SMU2SIGPPS4                      BANKMASK(SMT2SIGPPS), 4
#define SMU2WINPPS0                      BANKMASK(SMT2WINPPS), 0
#define SMU2WINPPS1                      BANKMASK(SMT2WINPPS), 1
#define SMU2WINPPS2                      BANKMASK(SMT2WINPPS), 2
#define SMU2WINPPS3                      BANKMASK(SMT2WINPPS), 3
#define SMU2WINPPS4                      BANKMASK(SMT2WINPPS), 4
#define SOR                              BANKMASK(OSCSTAT), 3
#define SOSCEN                           BANKMASK(OSCEN), 3
#define SOSCPWR                          BANKMASK(OSCCON3), 6
#define SPEN                             BANKMASK(RC1STA), 7
#define SREN                             BANKMASK(RC1STA), 5
#define SSP1CLKPPS0                      BANKMASK(SSP1CLKPPS), 0
#define SSP1CLKPPS1                      BANKMASK(SSP1CLKPPS), 1
#define SSP1CLKPPS2                      BANKMASK(SSP1CLKPPS), 2
#define SSP1CLKPPS3                      BANKMASK(SSP1CLKPPS), 3
#define SSP1CLKPPS4                      BANKMASK(SSP1CLKPPS), 4
#define SSP1DATPPS0                      BANKMASK(SSP1DATPPS), 0
#define SSP1DATPPS1                      BANKMASK(SSP1DATPPS), 1
#define SSP1DATPPS2                      BANKMASK(SSP1DATPPS), 2
#define SSP1DATPPS3                      BANKMASK(SSP1DATPPS), 3
#define SSP1DATPPS4                      BANKMASK(SSP1DATPPS), 4
#define SSP1IE                           BANKMASK(PIE3), 0
#define SSP1IF                           BANKMASK(PIR3), 0
#define SSP1SSPPS0                       BANKMASK(SSP1SSPPS), 0
#define SSP1SSPPS1                       BANKMASK(SSP1SSPPS), 1
#define SSP1SSPPS2                       BANKMASK(SSP1SSPPS), 2
#define SSP1SSPPS3                       BANKMASK(SSP1SSPPS), 3
#define SSP1SSPPS4                       BANKMASK(SSP1SSPPS), 4
#define SSP2CLKPPS0                      BANKMASK(SSP2CLKPPS), 0
#define SSP2CLKPPS1                      BANKMASK(SSP2CLKPPS), 1
#define SSP2CLKPPS2                      BANKMASK(SSP2CLKPPS), 2
#define SSP2CLKPPS3                      BANKMASK(SSP2CLKPPS), 3
#define SSP2CLKPPS4                      BANKMASK(SSP2CLKPPS), 4
#define SSP2DATPPS0                      BANKMASK(SSP2DATPPS), 0
#define SSP2DATPPS1                      BANKMASK(SSP2DATPPS), 1
#define SSP2DATPPS2                      BANKMASK(SSP2DATPPS), 2
#define SSP2DATPPS3                      BANKMASK(SSP2DATPPS), 3
#define SSP2DATPPS4                      BANKMASK(SSP2DATPPS), 4
#define SSP2IE                           BANKMASK(PIE3), 2
#define SSP2IF                           BANKMASK(PIR3), 2
#define SSP2SSPPS0                       BANKMASK(SSP2SSPPS), 0
#define SSP2SSPPS1                       BANKMASK(SSP2SSPPS), 1
#define SSP2SSPPS2                       BANKMASK(SSP2SSPPS), 2
#define SSP2SSPPS3                       BANKMASK(SSP2SSPPS), 3
#define SSP2SSPPS4                       BANKMASK(SSP2SSPPS), 4
#define SSPEN1                           BANKMASK(SSP1CON1), 5
#define SSPEN2                           BANKMASK(SSP2CON1), 5
#define SSPM01                           BANKMASK(SSP1CON1), 0
#define SSPM02                           BANKMASK(SSP2CON1), 0
#define SSPM11                           BANKMASK(SSP1CON1), 1
#define SSPM12                           BANKMASK(SSP2CON1), 1
#define SSPM21                           BANKMASK(SSP1CON1), 2
#define SSPM22                           BANKMASK(SSP2CON1), 2
#define SSPM31                           BANKMASK(SSP1CON1), 3
#define SSPM32                           BANKMASK(SSP2CON1), 3
#define SSPOV1                           BANKMASK(SSP1CON1), 6
#define SSPOV2                           BANKMASK(SSP2CON1), 6
#define START1                           BANKMASK(SSP1STAT), 3
#define START2                           BANKMASK(SSP2STAT), 3
#define STATE                            BANKMASK(WDTTMR), 2
#define STKOVF                           BANKMASK(PCON0), 7
#define STKUNF                           BANKMASK(PCON0), 6
#define STOP1                            BANKMASK(SSP1STAT), 4
#define STOP2                            BANKMASK(SSP2STAT), 4
#define SWDTEN                           BANKMASK(WDTCON0), 0
#define SYSCMD                           BANKMASK(PMD0), 7
#define T016BIT                          BANKMASK(T0CON0), 4
